**Fibbonacci Sequence**

In [20]:
n = int(input('Enter a number: '))
def fibo(n):
    if n <= 1:
        return n
    else:
        return fibo(n-1)+fibo(n-2)
for i in range(n):
    print(fibo(i),end=" ")

Enter a number: 10
0 1 1 2 3 5 8 13 21 34

**Prime Number**

In [19]:
def isPrime(n):
    if n == 0 or n == 1:
        return False
    for i in range(2, n // 2 + 1):
        if n % i == 0:
            return False
    return True

n = int(input("Enter a positive integer: "))
if isPrime(n):
    print('Prime')
else:
    print('Not Prime')

Enter a positive integer: 17
Prime

**Pandas Data Manipulation**

In [21]:
data = {
 'Date': ['2024-01-01', '2024-01-02', '2024-01-03', '2024-01-04', '2024-01-05'],
 'Sales': [200, 220, 210, 215, 225],
 'Region': ['North', 'South', 'East', 'West', 'North'],
 'Manager': ['John', 'Jane', 'Joe', 'Jake', 'John']
}

In [24]:
import pandas as pd

df = pd.DataFrame(data)
df.head()

         Date  Sales Region Manager
0  2024-01-01    200  North    John
1  2024-01-02    220  South    Jane
2  2024-01-03    210   East     Joe
3  2024-01-04    215   West    Jake
4  2024-01-05    225  North    John

In [26]:
df['Profit'] = df['Sales']*0.1
df

         Date  Sales Region Manager  Profit
0  2024-01-01    200  North    John    20.0
1  2024-01-02    220  South    Jane    22.0
2  2024-01-03    210   East     Joe    21.0
3  2024-01-04    215   West    Jake    21.5
4  2024-01-05    225  North    John    22.5

In [31]:
region_sales = df.groupby('Region')['Sales'].sum()
region_sales

Region
East     210
North    425
South    220
West     215
Name: Sales, dtype: int64

In [35]:
region_sales_avg = df.groupby('Region')['Sales'].mean()
print(region_sales_avg)
print('Highest: ',max(region_sales_avg),region_sales_avg.idxmax())

Region
East     210.0
North    212.5
South    220.0
West     215.0
Name: Sales, dtype: float64
Highest:  220.0 South

**Titanic Data Manipulation**

In [82]:
df = pd.read_csv(' https://raw.githubusercontent.com/datasciencedojo/datasets/master/titanic.csv')
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [83]:
df.info() ## Information about data

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Name         891 non-null    object
 4   Sex          891 non-null    object
 5   Age          714 non-null    float64
 6   SibSp        891 non-null    int64
 7   Parch        891 non-null    int64
 8   Ticket       891 non-null    object
 9   Fare         891 non-null    float64
 10  Cabin        204 non-null    object
 11  Embarked     889 non-null    object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.7+ KB

In [84]:
df.describe() ##Statistical View

,PassengerId,Survived,Pclass,Age,SibSp,Parch,Fare
count,891.000000,891.000000,891.000000,714.000000,891.000000,891.000000,891.000000
mean,446.000000,0.383838,2.308642,29.699118,0.523008,0.381594,32.204208
std,257.353842,0.486592,0.836071,14.526497,1.102743,0.806057,49.693429
min,1.000000,0.000000,1.000000,0.420000,0.000000,0.000000,0.000000
25%,223.500000,0.000000,2.000000,20.125000,0.000000,0.000000,7.910400
50%,446.000000,0.000000,3.000000,28.000000,0.000000,0.000000,14.454200
75%,668.500000,1.000000,3.000000,38.000000,1.000000,0.000000,31.000000
max,891.000000,1.000000,3.000000,80.000000,8.000000,6.000000,512.329200

In [85]:
df.isnull() ## Null Values

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,False,False,False,False,False,False,False,False,False,False,True,False
1,False,False,False,False,False,False,False,False,False,False,False,False
2,False,False,False,False,False,False,False,False,False,False,True,False
3,False,False,False,False,False,False,False,False,False,False,False,False
4,False,False,False,False,False,False,False,False,False,False,True,False
...,...,...,...,...,...,...,...,...,...,...,...,...
886,False,False,False,False,False,False,False,False,False,False,True,False
887,False,False,False,False,False,False,False,False,False,False,False,False
888,False,False,False,False,False,True,False,False,False,False,True,False
889,False,False,False,False,False,False,False,False,False,False,False,False
890,False,False,False,False,False,False,False,False,False,False,True,False

In [86]:
df.isnull().sum() ## Per Column

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age            177
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          687
Embarked         2
dtype: int64

In [87]:
df.isnull().sum().sum() ##Total Null Values

866

In [88]:
df['Age'].fillna(df['Age'].mean(),inplace=True)

In [89]:
df['Age'].isnull().sum() ## Null values filled permanently

0

In [90]:
df.dropna(subset=['Embarked'], inplace=True)

In [91]:
df['Embarked'].isnull().sum() ## Rows with null dropped

0

In [92]:
df['FamilySize'] = df['SibSp'] + df['Parch']
df[['SibSp','Parch','FamilySize']]

     SibSp  Parch  FamilySize
0        1      0           1
1        1      0           1
2        0      0           0
3        1      0           1
4        0      0           0
..     ...    ...         ...
886      0      0           0
887      0      0           0
888      1      2           3
889      0      0           0
890      0      0           0

[889 rows x 3 columns]

In [94]:
# Convert 'Sex' column to numerical values
print(df['Sex'].unique())

['male' 'female']

In [100]:
from sklearn.preprocessing import LabelEncoder
le = LabelEncoder()
df['Sex'] = le.fit_transform(df['Sex'])

In [101]:
df['Sex']

0      1
1      0
2      0
3      0
4      1
      ..
886    1
887    0
888    0
889    1
890    1
Name: Sex, Length: 889, dtype: int32

In [103]:
df['Sex'] = df['Sex'].map({0:1,1:0})

In [104]:
df['Sex']

0      0
1      1
2      1
3      1
4      0
      ..
886    0
887    1
888    1
889    0
890    0
Name: Sex, Length: 889, dtype: int64

In [105]:
df.groupby('Pclass')['Fare'].mean()

Pclass
1    84.193516
2    20.662183
3    13.675550
Name: Fare, dtype: float64

In [114]:
df.groupby('Embarked')['PassengerId'].count()

Embarked
C    168
Q     77
S    644
Name: PassengerId, dtype: int64

In [115]:
count = df.groupby('Embarked')['PassengerId'].count()
print('Maximum passengers embarked from ',count.idxmax())

Maximum passengers embarked from  S

In [116]:
pivot_table = df.pivot_table(
    index='Sex',
    columns='Pclass',
    values='Survived',
    aggfunc='mean'
)

print(pivot_table)

Pclass         1         2         3
Sex
0       0.368852  0.157407  0.135447
1       0.967391  0.921053  0.500000